# coding=CP1251
# Тестова програма для демонстрації того,
#   що опис умов можуть складатися з декількох рядків.
#   Кожен з рядків може бути лише лише відношенням,
#   і не може містити логічних операцій and, or, not.
#   Поки що не працює.
#   Потрібно реалізувати функцію для синтаксичного
#   аналізу рядків умов.

x = 16
y = 3

# AREA(Int)
# CP(I):
#   x > 0
#   y > 0
# ECP
r = x
q = 0
while y <= r:
    # CP(1):
    #   x == q * y + r
    # ECP
    r -= y
    q += 1

# CP(E):
#   x == q * y + r
#   r < y or y > 0
# ECP
print("q =", q, ", r =", r)
